# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# o	[2, 3, 4, 5, 6] => [12, 15, 16];
# o	[2, 3, 5, 6] => [12, 15]

n = [2, 3, 5, 6]
print(n)
product = []
for i in range((len(n) // 2)+1):
    product.append(n[i]*n[len(n)-i-1])
print(product)
